Revit 2024 API
PolylineSegments Methods
The PolylineSegments type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetVertices
 Returns an array of vertices of the polyline segments.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace